checker/app/controllers/checks_controller.rb

SELECT "users".* FROM "users" WHERE (private_number = '191214')
INSERT INTO "checks" ("type_check", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["type_check", 1], ["user_id", 1], ["created_at", "2021-01-30 01:58:15.805383"], ["updated_at", "2021-01-30 01:58:15.805383"]]
---
    def create
        check_p = check_params
        private_number = check_params[:private_number]
        user = User.where('private_number = ?', [private_number])[0]
        return if user?(user) == false
        type_check = get_type_check(user[:id])
        if type_check != :checked
            checked_created = user.checks.create({type_check: type_check})

SELECT "checks".* FROM "checks" WHERE (user_id = 1 and to_char(created_at, 'dd-mm-YYYY') = '30-01-2021')
SELECT 1 AS one FROM "checks" WHERE (user_id = 1 and to_char(created_at, 'dd-mm-YYYY') = '30-01-2021') LIMIT $1  [["LIMIT", 1]]
---
    def get_type_check(user_id)
        checks = Check.where("user_id = ? and to_char(created_at, 'dd-mm-YYYY') = ?", 1, Time.now.strftime("%d-%m-%Y"))
        if checks.empty?
            return 1
        elsif checks.length == 1