app/admin/attendences.rb

SELECT AVG(CAST(created_at AS TIME)) as average FROM "checks" WHERE (EXTRACT(MONTH from created_at) = 2 and type_check = 1)
SELECT AVG(CAST(created_at AS TIME)) as average FROM "checks" WHERE (EXTRACT(MONTH from created_at) = 2 and type_check = 2)
---
        def attendences
            @month = params[:month] != nil ? params[:month] : Time.now.strftime("%m").to_i
            @report = Check.where("EXTRACT(MONTH from created_at) = #{@month}")
            @avg_in = Check.select("AVG(CAST(created_at AS TIME)) as average").where("EXTRACT(MONTH from created_at) = 2 and type_check = 1")[0]
            @avg_out = Check.select("AVG(CAST(created_at AS TIME)) as average").where("EXTRACT(MONTH from created_at) = 2 and type_check = 2")[0]