app/admin/checks.rb

      r[:type_check] == 1 ? "Check in" : "Check out"
    end
    column :user_id do |r|
      User.find(r[:user_id])[:name]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]