app/admin/users.rb

SELECT "companies".* FROM "companies"
---
  #   permitted
  # end
  form title: 'New User' do |f|
    f.input :company_id, as: :select, collection: Company.all.map { |u| [u.name, u.id] }, include_blank: false

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      status_tag(r[:enabled] == 1 ? 'Yes' : 'No')
    end
    column :company_id do |r|
      Company.find(r[:company_id])[:name]