app/views/admin/attendences/_attendences.html.erb

            <td><%= element[:id] %></td>
            <td><%= User.find(element[:user_id])[:name] %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]